14-rails-associations/app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 3]]
---
<p>reviews by this user</p>
<% @user.reviews.each do |review| %>