15-rails-validations/app/views/films/index.html.erb

<% @films.each do |film| %>
    <h2><%= link_to film.title, film_path(film) %> reviewed <%= film.reviews.size %> <%= 'time'.pluralize(film.reviews.size) %>, average rating <%= film.average_rating %>/5</h2>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."film_id" = ?  [["film_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."film_id" = ?  [["film_id", 1]]