15-rails-validations/app/views/films/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."film_id" = ?  [["film_id", 2]]
---

<% @film.reviews.each do |review| %>