15-rails-validations/app/models/film.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."film_id" = ?  [["film_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."film_id" = ?  [["film_id", 1]]
---
    def average_rating
        if self.reviews.size == 0
            return 'N/A'
        end
        total = self.reviews.reduce(0){|total, review| total + review.rating }
        total / self.reviews.size