15-rails-validations/app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT "films".* FROM "films"
---
  def show
    @film = Film.find(params[:id])
    @review = Review.new(film: @film)
    @users = User.all
    @films = Film.all

INSERT INTO "films" ("title", "runtime", "director", "genre", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    film = Film.create(
        title: film_params[:title],
        director: film_params[:director],
        release_date: film_params[:release_date],
        runtime: film_params[:runtime],
        genre: film_params[:genre],
        )

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @film = Film.find(params[:id])

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "films" SET "title" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["title", "star wars 7"], ["updated_at", "2020-01-10 11:38:06.097648"], ["id", 4]]
---
  def update
    film = Film.find(params[:id])
    film.update(
        title: film_params[:title],
        director: film_params[:director],
        release_date: film_params[:release_date],
        runtime: film_params[:runtime],
        genre: film_params[:genre],
        )

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 4]]
---
  def destroy
    film = Film.find(params[:id])
    film.destroy