15-rails-validations/app/controllers/reviews_controller.rb

    def new
        @review = Review.new
        @users = User.all
        @films = Film.all
---
SELECT "users".* FROM "users"
SELECT "films".* FROM "films"

    def create
        review = Review.create(review_params)
---
INSERT INTO "reviews" ("rating", "content", "user_id", "film_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["content", "good"], ["user_id", 3], ["film_id", 1], ["created_at", "2020-01-13 11:39:12.801312"], ["updated_at", "2020-01-13 11:39:12.801312"]]