18-sessions-cookies/app/views/answers/new.html.erb

<% end %>
<% if !User.all.empty? %>
---
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]

    <tbody>
        <% User.all_sorted_by_answers.each do |user| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 1]]