14-rails-associations/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "sss@sss"], ["username", "sss"], ["created_at", "2020-01-13 11:05:06.244689"], ["updated_at", "2020-01-13 11:05:06.244689"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "sam"], ["updated_at", "2020-01-13 11:09:21.177558"], ["id", 4]]
---
    def update
        user = User.find(params[:id])
        user.update(user_params)