18-sessions-cookies/app/models/answer.rb

  def user_name= name
    self.user = User.find_or_create_by name: name
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sam"], ["created_at", "2019-05-27 13:37:09.927598"], ["updated_at", "2019-05-27 13:37:09.927598"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "sam"], ["LIMIT", 1]]