18-sessions-cookies/app/models/cookie.rb

    def self.options cookie
        possible_cookies = self.all.sample 3
---
SELECT "cookies".* FROM "cookies"