18-sessions-cookies/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_current_user
        if logged_in?
            @current_user = User.find(session[:user_id])