18-sessions-cookies/app/controllers/sessions_controller.rb

  def authenticate
    # rewrite for a nicer if
    user = User.find_by(name: params['username'])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Daniel Kaczmarczyk"], ["LIMIT", 1]]